## ANA-522-OL1 Spring 2022
## Mod04 Week08 Lab: Data Aggregation and Group Operations Lab
## Suggested Due: Friday March 4th at midnight ( No need to submit )

## Titanic Dataset
The sinking of the Titanic is one of the most infamous shipwrecks in history.  

On April 15, 1912, during her maiden voyage, the widely considered “unsinkable” RMS Titanic sank after colliding with an iceberg. Unfortunately, there weren’t enough lifeboats for everyone onboard, resulting in the death of 1502 out of 2224 passengers and crew.  

While there was some element of luck involved in surviving, it seems some groups of people were more likely to survive than others. With the availabilities of data analytic and machine learning technologies these days, people are researching in finding clues of survival from hidden data patterns.

Our purpose in this Lab exercise is to transform the dataset with proper multiple indexing and reshaping so as to easily slice information from categorical perspectives.

#### The Titanic dataset is readily available to be loaded on ANA522 JupyterLab with the filename:      
#### "/home/ANA522/Titanic.csv"

<img src="http://mathqs.mcdaniel.edu/ANA522/exam/Titanic_DD.png" width="800">

<img src="http://mathqs.mcdaniel.edu/ANA522/exam/Titanic_Var_Note.png" width="600">

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
titanic = pd.read_csv('/home/ANA522/Titanic.csv', sep=',')
titanic.shape

### Q01. Group Titanic dataset by Sex attribute to see Age statistic.
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q01.png" 
     width="500" height="300" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>grouped_Sex=titanic.groupby(titanic['Sex'])
grouped_Sex.describe()[['Age']]</code>
</details>

### Q02. Display average stats of all Titanic dataset attributes grouped by Sex
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q02.png" 
     width="600" height="400" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>grouped_Sex.mean()</code>
</details>

### Q03. Display only Age average stats of Titanic dataset grouped by Sex
<pre>
Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64
</pre>

<details>
<summary>Solution</summary>
<code>grouped_Sex.mean()['Age']</code>
</details>

### Q04. Group Titanic dataset by both Sex and Pclass to see Age statistic.
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q04.png" 
     width="500" height="300" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>grouped_Sex_Pclass = titanic.groupby(['Sex','Pclass'])
grouped_Sex_Pclass.describe()['Age']</code>
</details>

### Q05. Display average stats of Titanic dataset attributes grouped by Sex and Pclass
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q05.png" 
     width="600" height="400" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>grouped_Sex_Pclass.mean()</code>
</details>

### Q06. Display survival rate of Titanic dataset grouped by Sex and Pclass
<pre>
Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64
</pre>

<details>
<summary>Solution</summary>
<code>grouped_survival_mean_rate = grouped_Sex_Pclass.mean()['Survived']
grouped_survival_mean_rate</code>
</details>

### Q07. Display survival rate of Titanic dataset with Sex as index and Pclass as columns
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q07.png" 
     width="300" height="150" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>grouped_survival_mean_rate.unstack()</code>
</details>

### Q08. Use another groupby approach to Display survival rate of Titanic dataset with Sex as index and Pclass as columns
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q08.png" 
     width="300" height="150" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>grouped_survival_mean_rate2 = titanic['Survived'].groupby([titanic.Sex,titanic.Pclass]).mean()
grouped_survival_mean_rate2.unstack()</code>
</details>

### Q09. Display indexing name and details of Titanic dataset grouped by Embarked
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q09_1.png" 
     width="500" height="300" alt="attributes list" />
     <br>
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q09_2.png" 
     width="500" height="300" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>for name, group in titanic.groupby('Embarked'):
    print(name)
    print(group)</code>
</details>

### Q10. Display indexing name and details of Titanic dataset grouped by Pclass and Embarked
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q10_1.png" 
     width="200" height="100" alt="attributes list" /><br>
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q10_2.png" 
     width="200" height="100" alt="attributes list" /><br>
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q10_3.png" 
     width="200" height="100" alt="attributes list" /><br>
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q10_4.png" 
     width="200" height="100" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>for (pname,ename), group in titanic.groupby(['Pclass','Embarked']):
    print((pname,ename))
    print(group)</code>
</details>

### Q11. Display Age and Fare differences within Sex and Pclass groups of Titanic dataset by implementing an aggregation function
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q11.png" 
     width="250" height="120" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>def max_to_min(arr):
    return arr.max() - arr.min()
    
grouped = grouped_Sex_Pclass.agg(max_to_min)[['Age','Fare']]
grouped</code>
</details>

### Q12. Display Age and Fare minimum and maximum of all Sex and Pclass groups of Titanic dataset. In addition, annotate the name of each column.
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q12.png" 
     width="350" height="200" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>grouped = grouped_Sex_Pclass.agg([('Minimum','min'),('Maximum','max')])[['Age','Fare']]
grouped</code>
</details>

### Q13. Define a generic top function using top 10 and Fare column as arguments default. List the top 10 Fares of Titanic dataset.
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q13.png" 
     width="800" height="600" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>def top(df, n=10, column='Fare'):
    return df.sort_values(by=column, ascending=False)[:n]

top(titanic)</code>
</details>

### Q14. Apply the top function to display full information of top three Fares grouped by Sex and Pclass of Titanic dataset.
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q14.png" 
     width="800" height="600" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>grouped_Sex_Pclass.apply(top,n=3)</code>
</details>

### Q15. Apply the top function to display full information of top five Age grouped by Sex and Pclass of Titanic dataset. 
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q15.png" 
     width="800" height="600" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>grouped_Sex_Pclass.apply(top,n=5,column='Age')</code>
</details>

### Q16. Display average Age and Fare grouped by Sex and Pclass of Titanic dataset using pivot_table
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q16.png" 
     width="300" height="400" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>titanic.pivot_table(['Age','Fare'],index=['Sex','Pclass'])</code>
</details>

### Q17. Overview total number of passengers with Pclass as columns and Sex as rows of Titanic dataset using crosstab
<img src="http://mathqs.mcdaniel.edu/ANA522/mod04/img/W8T_Q17.png" 
     width="250" height="150" alt="attributes list" />

<details>
<summary>Solution</summary>
<code>pd.crosstab(titanic.Sex, titanic.Pclass, margins=True)</code>
</details>